console.log(`Функционал (100 баллов):

(+50 баллов) Слайдер изображений в секции destinations
	 (+20 баллов) на десктоп варианте при клике на урезанную картинку слева или справа изображение меняется по принципу карусели(например если нажать правую картинку та что была в центре на уезжает налево, а та что была видна наполовину оказывается справа).
 	 (+20 баллов) Три точки внизу отображают "номер слайда", то есть каждому слайду соответствует свой кружочек, который становится активным при нахождении соответствующего ему слайда в центре. На мобильном варианте картинка одна, но поверх нее появляются стрелочки навигации (можно сделать как карусель или же затемнять кнопку если слайдер достиг края).
 	 (+10 баллов) Анимации плавного перемещения для слайдера.

(+50 баллов) Нажатие на кнопку Login (кнопка Account в мобильной версии) показывает сверстанный логин попап.
  	(+25 баллов) логин попап соответствует верстке его закрытие происходит при клике вне попапа.
  	(+25 баллов) логин попап имеет 2 инпута (логин и пароль) при нажатии на кнопку Sign In показывается браузерный алерт с введенными данными (для реализации можно использовать тег ).
  	
(+25 баллов) Нажатие на кнопку Register на Login попапе меняет разметку попапа на разметку Sign Up попапа согласно макету (То есть нажатие не закрывает модал а просто меняет его наполнение).`);

